Authored by Mukul Malik,	Jeetaksh Gandhi, 	Parag Rachchh
	    21ucs133		21ucs098		21ucs143

//////////////////////////////////////////////////////////////////////

Originally, we tried using a custom made LSTM given in model2.ipynb. 
This would allow for a good ablation study. It worked almost perfectly
till a good point until it did not. The structure of that model is:

______________________________________________________________________________________________________________
Layer (type)                                     Output Shape                                Param #          
==============================================================================================================
input (InputLayer)                               [(None, None, 193)]                         0                
______________________________________________________________________________________________________________
expand_dim (Reshape)                             (None, None, 193, 1)                        0                
______________________________________________________________________________________________________________
conv_1 (Conv2D)                                  (None, None, 97, 32)                        14432            
______________________________________________________________________________________________________________
conv_1_bn (BatchNormalization)                   (None, None, 97, 32)                        128              
______________________________________________________________________________________________________________
conv_1_relu (ReLU)                               (None, None, 97, 32)                        0                
______________________________________________________________________________________________________________
conv_2 (Conv2D)                                  (None, None, 49, 32)                        236544           
______________________________________________________________________________________________________________
conv_2_bn (BatchNormalization)                   (None, None, 49, 32)                        128              
______________________________________________________________________________________________________________
conv_2_relu (ReLU)                               (None, None, 49, 32)                        0                
______________________________________________________________________________________________________________
reshape (Reshape)                                (None, None, 1568)                          0                
______________________________________________________________________________________________________________
bidirectional_1 (Bidirectional)                  (None, None, 1024)                          6395904          
______________________________________________________________________________________________________________
dropout (Dropout)                                (None, None, 1024)                          0                
______________________________________________________________________________________________________________
bidirectional_2 (Bidirectional)                  (None, None, 1024)                          4724736          
______________________________________________________________________________________________________________
dropout_1 (Dropout)                              (None, None, 1024)                          0                
______________________________________________________________________________________________________________
bidirectional_3 (Bidirectional)                  (None, None, 1024)                          4724736          
______________________________________________________________________________________________________________
dropout_2 (Dropout)                              (None, None, 1024)                          0                
______________________________________________________________________________________________________________
bidirectional_4 (Bidirectional)                  (None, None, 1024)                          4724736          
______________________________________________________________________________________________________________
dropout_3 (Dropout)                              (None, None, 1024)                          0                
______________________________________________________________________________________________________________
bidirectional_5 (Bidirectional)                  (None, None, 1024)                          4724736          
______________________________________________________________________________________________________________
dense_1 (Dense)                                  (None, None, 1024)                          1049600          
______________________________________________________________________________________________________________
dense_1_relu (ReLU)                              (None, None, 1024)                          0                
______________________________________________________________________________________________________________
dropout_4 (Dropout)                              (None, None, 1024)                          0                
______________________________________________________________________________________________________________
dense (Dense)                                    (None, None, 2)                             2050             
==============================================================================================================

On training with LJSpeech dataset, it gave an error (NULL values after NON-NULL).
We spent weeks trying to figure it out but to no avail and we eventually
ran out of time.

Then we decided to shift gears to using a famous, pre-trained models
to avoid code error and intricacies with a new dataset. We chose DeepSpeech
and LibriSpeech Dataset. A huge amount of energy went into adapting this dataset
for DeepSpeech. Other details are provided in the report itself.

-----------------------------------------------------------------------------------------

Thus we have also attached this model that we worked on previously in model2.ipynb.
All training was done on DGX.
The final report was produced in LaTeX.
Overleaf Link: https://www.overleaf.com/read/gfyyrxgzsdvx#c4b3f2

Happy reading ~



